import React from "react";
import MainHeader from "./MainHeader";
import { BackLinkAtom } from "./BackLink";
import {
  AboutUsBlock,
  AboutUsContainer,
  Map,
  ProductsText,
  BlockQuote,
  CEOImage,
  CeoFigure,
  CeoName,
  CeoWrapper,
} from "components/atoms";
import map from "../../assets/images/map.png";
import aleksandr from "../../assets/images/aleksandr.jpg";
import { Footer } from "./Footer";
import ScrollToTopOnMount from "utils/scrollRestorationFix";

export const AboutUs = () => {
  return (
    <>
      <MainHeader isCart={true} />
      <ScrollToTopOnMount />
      <BackLinkAtom id={"backButton"} to={"/"} children={"Назад"} />
      <AboutUsBlock>
        <h1>О нас</h1>
        <AboutUsContainer>
          {/* <BlockQuote>
            <div>
              <p>
                <span>МЫ</span> - заготовители, фермеры и переработчики. <br />
              </p>
              <p>
                <span>МЫ</span> бережно используем сибирскую тайгу и землю,
                сохраняя их в первозданном виде.
                <br />
              </p>
              <p>
                <span>МЫ</span> объединяем более 80 предпринимателей
                Красноярского края
                <br />
              </p>
              <p>
                <span>МЫ</span> предлагаем простые и повседневные продукты не
                забывая о вкусе и пользе.
              </p>
              <p>
                <span>МЫ</span> заботимся о хрупком равновесии, существующем
                между нашей планетой и людьми, которые ее населяют, поэтому
                производим продукты, предназначенные для благополучия человека и
                природы
              </p>
            </div>
          </BlockQuote> */}
          <Map src={map} />
        </AboutUsContainer>
        <ProductsText style={{ marginTop: "40px" }}>
          С 2019 года, объединившись в Органический кластер, разделяя принципы
          органического производства, мы создаем качественные продукты питания,
          косметику и биологические добавки.
        </ProductsText>
        <CeoWrapper>
          <CeoFigure>
            <CEOImage src={aleksandr} />
            <CeoName>
              Александр Граматунов, <br />
              Председатель совета Ассоциации &quot;Содействие производителям и
              переработчикам органической продукции Красноярского края&quot;
            </CeoName>
          </CeoFigure>
          <div className="bigQuote">
            <blockquote>
              <p>
                Величественные леса и бескрайние просторы Сибири, которые мы
                унаследовали от наших предков, являются источником несметных
                богатств. Эти земли, окутанные тайной и магией, дарят нам
                уникальные продукты, созданные самой природой. Наши предки их
                бережно хранили, брали только то, что было необходимо для
                поддержания жизни и здоровья, и передали нам эти ценности.
              </p>

              <p>
                Сибирь - это не просто территория, это место, где живут люди,
                которые любят и ценят свою землю. Здесь, в глубинах сибирских
                лесов, скрываются несметные богатства, которые могут принести
                счастье людям по всему миру.
              </p>

              <p>
                Наша миссия - обеспечить баланс, сохранить хрупкое равновесие
                между использованием этих богатств и сохранением природы в ее
                первозданном виде. Мы стремимся открыть эти богатства для всего
                человечества, предлагая продукты, которые воплощают силу и
                энергию сибирской земли.
              </p>

              <p>
                Наша продукция - это не просто товары, это часть нашего
                наследия, часть нашей души. Мы предлагаем вам продукты,
                созданные из натуральных ингредиентов. Это продукты, которые
                укрепляют иммунитет и дают живительную силу, продукты, которые
                воплощают в себе всю любовь к Сибирскому краю.
              </p>

              <p>
                Мы гордимся тем, что можем предложить вам эти уникальные
                продукты, и мы верим, что они смогут принести в вашу жизнь
                немного сибирской магии. Почувствуйте Сибирь! Откройте для себя
                её уникальность и неповторимость!
              </p>
            </blockquote>
          </div>
        </CeoWrapper>
      </AboutUsBlock>

      <Footer />
    </>
  );
};
