import React, { useState } from "react";
import MainHeader from "./MainHeader";
import { BackLinkAtom } from "./BackLink";
import {
  AboutUsBlock,
  AboutUsContainer,
  SiberiaLogoAboutUs,
  SiberiaBrandInfo,
  ArticleImage,
  ArticleInfo,
} from "components/atoms";
import important from "../../assets/images/important.jpg";
import lees from "../../assets/images/lees.jpg";
import join from "../../assets/images/join.jpg";
import gather from "../../assets/images/gather.jpg";
import honey from "../../assets/images/honey.jpg";
import { Footer } from "./Footer";
import ScrollToTopOnMount from "utils/scrollRestorationFix";
import { useLocation, useParams } from "react-router";
import { PartnerModal } from "components/PartnerModal";

const titleText: any = {
  important: <>Siberia Organic</>,
  join: <>Почему стоит работать с Siberia organic?</>,
  gather: <>ЧГК на тему дикоросов</>,
  lees: <>Лисички</>,
  honey: <>Польза мёда</>,
};

const titleImage: any = {
  important: important,
  join: join,
  gather: gather,
  lees: lees,
  honey: honey,
};

export const Article = () => {
  const { title } = useParams<{ title: string }>();
  const [isPartnerModalVisible, setPartnerModalVisible] = useState(false);

  const articleText: any = {
    important: (
      <>
        <p>
          Siberia organic, как образ мысли и жизни — это проект, созданный для
          восстановления традиций и достоинства способа выращивания растений и
          животных, сбора дикоросов, приготовления еды и желания внести свой
          вклад в жизнь людей и планеты.
        </p>
        <p>
          Когда мы выбираем какую еду приготовить и что подать на стол, мы также
          выбираем, будут ли пейзажи вокруг нас красивыми, будут ли они
          содержать биоразнообразие и звуки, будет ли нам по-прежнему интересно
          смотреть на них.
        </p>
        <p>
          Мы попытаемся объяснить, что стоит за нашими органическими продуктами
          и внутри них, используя современные способы донесения информации.
        </p>
        <p>
          Если вы говорите «органический», что вы имеете в виду? Красота,
          забота, ответственность, будущее...?
        </p>
        <p>
          Игра слов, воплощенная в видеофильме, публикациях и многом другом,
          документирующем путь продукта от наших полей, лесов, ферм, производств
          к вашему кухонному столу.{" "}
        </p>

        <p>От наших людей. Для тебя. С любовью и заботой.</p>
      </>
    ),
    join: (
      <>
        <p>У нас партнёрство, основанное на здоровой любви к:</p>

        <h5>ЛЮДЯМ</h5>
        <p>
          Как внутри команды ={">"} выстраиваем весь рабочий процесс так, чтобы
          участники сообщества были всегда в фокусе внимания:
        </p>
        <ul>
          <li>— поддержка всех представителей Siberia organic</li>
          <li>
            — помощь в продвижении, сертификации и распространении продукции
          </li>
          <li>
            — обмен знаниями и навыками, без культурных и географических
            барьеров
          </li>
          <li>— общий рост и развитие</li>
        </ul>

        <p>
          Так и во вне ={">"} поэтому для наших покупателей мы производим только
          натуральные продукты без вредных добавок!
        </p>

        <p>
          Благодаря людям создается и развивается наш бренд. Именно страсть,
          способности и личный вклад позволяют нам расти, достигая всех
          поставленных целей
        </p>

        <h5>ПРИРОДЕ</h5>
        <p>
          Мы собираем дары природы грамотно и бережно, не нарушая целостности
          экосистемы!
        </p>

        <p>
          Присоединяясь к Siberia organic, каждый берет на себя обязательство
          сохранять лесные богатства Сибири, стремиться освободить землю от
          химикатов и представлять единый бренд как гарантию традиций, инноваций
          и качества.
        </p>

        <p>
          Мы ищем людей, которые разделяют наши ценности и готовы вместе строить
          здоровое будущее
        </p>

        <p>
          Заполняйте{" "}
          <span
            style={{ cursor: "pointer" }}
            onClick={() => setPartnerModalVisible(true)}
          >
            <b>
              <u>анкету</u>
            </b>
          </span>
        </p>
        <h3>Мы всегда в поиске:</h3>
        <ul>
          <li>— сборщика сырья</li>
          <li>— организатора пункта приёма дикоросов</li>
          <li>— производителя здоровых и качественных продуктов</li>
        </ul>
        <p>До встречи в Siberia organic</p>
      </>
    ),
    gather: (
      <>
        <ul>
          <li>
            <h5>🍀ЧТО за «зверь»?</h5>
            Дикоросы — дикорастущие растения, ягоды, орехи, грибы. Это плоды
            природы, которые вырастают в естественной среде без вмешательства
            человека. А значит, не подвергаются обработке гербицидами,
            пестицидами и другими химикатами, в отличии от выращенных
            сельскохозяйственных культур.
          </li>

          <li>
            <h5>🍀 ГДЕ искать?</h5>
            Наш край богат местами, куда ни раз ступала нога лесника, но ещё
            сохранилась живая уникальная флора. Сибирские леса — дом для
            дикоросов. Важно помнить, что, отправляясь за урожаем, мы приходим в
            гости. Поэтому только бережный сбор!
          </li>

          <li>
            <h5>🍀 КОГДА собирать?</h5>
            Всё зависит от вида и региона. Лучше узнать об особенностях заранее,
            чтобы не прогадать и главное: не навредить! Например, не
            рекомендуется собирать растения в дождливые дни и туман. Лучшее
            время: после высыхания утренней росы. А вот с ягодами другая история
            ={">"} обычно за ними отправляются по мере полного созревания.
            Однако легко осыпающиеся плоды собирают раньше. И в определение
            время: рано утром или вечером, так как собранные днем (особенно в
            сильную жару), они быстрее портятся.
          </li>
        </ul>

        <p>
          Всегда можно попробовать себя в роли лесника, но лучше довериться
          профессионалам. Тем более в ассортименте Siberia Organic широчайший
          выбор дикоросов😉
        </p>
      </>
    ),
    lees: (
      <>
        <h4>Представляем вам команду супер-героев Siberia Organic: Лисички</h4>

        <h5>Всё, что вам нужно знать о героях:</h5>
        <ul>
          <li>привлекают внимание яркими костюмами</li>

          <li>
            не подвержены злу благодаря своему «геному» — хитинманноза в
            лисичках уничтожает всех паразитов!
          </li>

          <li>
            способны заменить частичку солнца — дарят половину дневной нормы
            витамина D
          </li>

          <li>
            обладают силой врачевания — лечат от «куриной слепоты» и других
            глазных заболеваний, очищают печень, ускоряют заживление ран,
            замедляют развитие рака, нормализуют пищеварение и работу ЖКТ и
            много других способностей в защите главного — здоровья людей!
          </li>

          <li>рекордсмены по наличию «в крови» магнеца и витамина А</li>
        </ul>
        <p>
          Завершаем знакомство милой традицией: Лисички — желанные гости на
          любой свадьбе в Нормандии
        </p>
      </>
    ),
    honey: (
      <>
        <h4>Если нужно добавить энергии — добавь меда</h4>
        <ul>
          <li> — быстрый источник для подзарядки вашего организма</li>

          <li> — полезная и ВКУСНАЯ замена сладкому</li>

          <li> — это тот самый Робин, помощник Бэтмена в борьбе с вирусами</li>

          <li>
            {" "}
            — золотой фонд антиоксидантов = уменьшает риск сердечных приступов,
            инсультов и некоторых видов рака.
          </li>
        </ul>

        <p>
          И, конечно, помните: «мёд — это очень уж хитрый предмет»© И дело не
          только в том, что: «если он есть, то его сразу нет😋». Но и в другом:
        </p>
        <ul>
          <li>
            — при нагревании свыше 45 градусов он теряет эффективность,
            превращаясь просто в сладость
          </li>
          <li>— только в натуральном продукте есть все полезные свойства!</li>
        </ul>

        <p>
          Поэтому в линейке Бренда Siberia Organic мёд — это чистый дар природы.
        </p>

        <p>
          Кстати, мы вспомнили ещё одно изречение известного персонажа: мёд —
          лучший подарок
        </p>
      </>
    ),
  };

  return (
    <>
      <MainHeader isCart={true} />
      <ScrollToTopOnMount />
      <BackLinkAtom id={"backButton"} to={"/"} children={"Назад"} />
      <AboutUsBlock>
        <h1>{titleText[title as keyof typeof titleText]}</h1>
        <AboutUsContainer>
          <ArticleInfo>
            <ArticleImage src={titleImage[title as keyof typeof titleImage]} />
            {articleText[title as keyof typeof articleText]}
          </ArticleInfo>
        </AboutUsContainer>
      </AboutUsBlock>

      <PartnerModal
        isOpen={isPartnerModalVisible}
        setModalOpen={setPartnerModalVisible}
      />

      <Footer />
    </>
  );
};
