import { PersonalAgreementWrapper } from "components/atoms";
import MainHeader from "./MainHeader";

export const PersonalDataCollection = () => {
  return (
    <>
      <MainHeader isCart={true} />
      <PersonalAgreementWrapper>
        <h1>
          Согласие на обработку персональных данных при заполнении Анкеты-заявки
          на участие в проекте Siberia organic
        </h1>

        <p>
          Настоящим в соответствии с п. 4, ст. 9 Федерального закона от 27.07.
          2006 N 152-ФЗ &quot;О персональных данных&quot; даю свое согласие
          Ассоциации &quot;Содействие производителям и переработчикам
          органической продукции Красноярского края&quot; (далее- Ассоциация) на
          обработку моих персональных данных, указанных мною в данной
          анкете-заявке на участие в проекте Siberia organic.
        </p>
        <p>
          Предоставляю Ассоциации право пользования моими персональными данными,
          включая сбор, систематизацию, накопление, хранение, обновление,
          изменение, использование, обезличивание, блокирование, уничтожение.
          Ассоциация вправе обрабатывать мои персональные данные посредством
          внесения их в электронную базу данных, включения их в списки (реестры)
          и отчетные формы, использовать мои персональные данные в
          информационных системах.
        </p>
        <p>
          {" "}
          Настоящее согласие действует с даты заполнения данной анкеты и может
          быть мной отозвано письменным заявлением.
        </p>
      </PersonalAgreementWrapper>
    </>
  );
};
